Sank7383/ESP8266_Newmesh/NewMeshNOW.h
    char *encodedString = urlencodes;
    size_t outLen = 0;
    size_t maxLen = sizeof(urlencodes) - 1;

    for (size_t i = 0; str[i] && outLen < maxLen; i++) {
        char c = str[i];

        if (c == ' ') {
            if (outLen + 1 < maxLen) { *encodedString++ = '+'; outLen++; }
        } else if (isalnum((unsigned char)c) || c == '.' || c == '-' || c == '_') {
            if (outLen + 1 < maxLen) { *encodedString++ = c; outLen++; }
        } else {
            if (outLen + 3 < maxLen) {
                *encodedString++ = '%';
                *encodedString++ = "0123456789ABCDEF"[(c >> 4) & 0xF];
                *encodedString++ = "0123456789ABCDEF"[c & 0xF];
                outLen += 3;
            }
        }
    }

    *encodedString = '\0';
    return urlencodes;
}

String urlencode(String str)
{
  String encodedString = "";
  char c;
  char code0;
  char code1;
  if (str.length() == 0)
    return "";
  if (str == "null")
    return "";
  for (int i = 0; i < str.length(); i++)
  {
    c = str.charAt(i);
    // Percent-encode control characters (e.g. '\n') instead of silently
    // dropping them — a dropped newline in a multi-line settings/debug
    // value used to vanish on the wire with no indication anything was
    // wrong. Bytes >=123 are still passed to the else branch below and
    // percent-encoded normally rather than skipped.
    if (c == ' ')
    {
      encodedString += '+';
    }
    else if (c == '.')
    {
      encodedString += '.';
    }
    else if (isalnum(c))
    {
      encodedString += c;
    }
    else
    {
      code1 = (c & 0xf) + '0';
      if ((c & 0xf) > 9)
      {
        code1 = (c & 0xf) - 10 + 'A';
      }
      c = (c >> 4) & 0xf;
      code0 = c + '0';
      if (c > 9)
      {
        code0 = c - 10 + 'A';
      }
      encodedString += '%';
      encodedString += code0;
      encodedString += code1;
    }
  }
  return encodedString;
}

int connum=-1;
void debugdata(const char *buf)
{
  // Broadcast to every locally-connected WebSocket client (port 81), not
  // just one tracked via connum — that single-client mechanism reset
  // itself to "nobody" the moment its one client sent any message (e.g.
  // the /forms page's "Test" command), silently killing all debug output.
  // Tagged "DBG:" so it's easy to pick out from FORM:/Connected:/status
  // traffic when watching the raw socket.
  String tagged = "DBG:" + String(buf);
  webSocket.broadcastTXT(tagged.c_str());
}

String hourmin(int timehour)
{
  return String((timehour / 60) % 24) + ":" + String((timehour % 60));
}

void sendFormData(int formno);

void copyString(char array[], String s, int sizearray)
{
  strcpy(array, s.substring(0, sizearray - 1).c_str());
}
void writeEpromS(String s, int address, int length)
{
  int i;
  for (i = 0; i < s.length() && i < length; ++i)
  {
    EEPROM.write(address + i, s[i]);
  }
  for (; i < length; i++)
    EEPROM.write(address + i, 0);
}

void getFormData(const char *formdata, int socketnumber);

void getCurrentStatus1(char *buffer, size_t buflen);

bool AmServer()
{
  if (ethercon==1)
  {
    return 1;
  }
  if (WiFi.status() == 3)
  {
    if (WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_"))
      return 0;
    else if (WiFi.SSID().startsWith(MESHNETWORK))
      return 0;
    else
      return 1;
  }
  else
    return 1;
}
bool amServer = 1;
char lastmsgsent[200];
unsigned long lastmsgsentat=0;

bool isConnected()
{
  #ifdef ether86
  if (ethercon==1) return eth.isLinked();
  #else
  if (ethercon==1) return true;
  #endif
  if (WiFi.status()==WL_CONNECTED) return true;
  else return false;
}

int senddata(String cdata,String ip="",String url="")
{
  WiFiClient client;
  int httpPort = 80;
  if (WiFi.status()!=WL_CONNECTED) return 0;
  String host=WiFi.gatewayIP().toString();
  if (!client.connect(host, httpPort)) {
    return 0;
  }

  if (cdata.indexOf("EVENT")<0) return 0;
  cdata.replace(" ","%20");
  String streamId="/send?c="+cdata;
  client.print("GET " + streamId + " HTTP/1.1\r\n" +
               "Host: " + String(host)  + "\r\n" +
               "Connection: close\r\n\r\n");
  unsigned long timeout = millis();
  while (client.available() == 0) {
    ESP.wdtFeed(); yield();
    if (millis() - timeout > 500) {
      client.stop();
      return 0;
    }
  }
  client.stop();
  return 1;
}

void sendToAll(const char *msg, int isServer)
{
  if (outTopic[0]==0) {
    snprintf(outTopic, sizeof(outTopic), "light-out/%s/%s", String(ESP.getChipId(), 16).c_str(), ID.c_str());
  }
  String s;
  if (!strncmp(lastmsgsent,msg,199)){
    if (nowmillis-lastmsgsentat<1000  )
    {
      debugdata(String("SENDTOALL: suppressed duplicate within 1s: '" + String(msg) + "'").c_str());
      return;
    }
  }
  lastmsgsentat=nowmillis;
  strncpy(lastmsgsent,msg,199);

  if (isServer != 2)
    s = ID + "=" + String(msg);
  else
    s = String(msg);

  debugdata(String("SENDTOALL: amServer=" + String(amServer ? 1 : 0) + " msg='" + s + "'").c_str());

  if (amServer)
  {
    if (s.indexOf("EVENT:")<0 && s.indexOf("s")!=0) {
      // Local AP-connected clients (this device's own WebSocket server,
      // port 81) are always reachable regardless of whether STA has
      // joined an upstream network — isConnected() must NOT gate this,
      // only whether ESP-NOW mesh forwarding also makes sense below.
      webSocket.broadcastTXT(s.c_str());
#ifdef ESPNOWACTIVE
  sendMeshMessage(0,s.c_str(),1);
#endif
    }
#ifndef MQTTNOTREQUIRED
    if (isServer != 2)
    {
      if (client.connected())
      {
        if (s.indexOf("update_status") < 0 && s.indexOf("room_connect") < 0)
          client.publish(outTopic, msg);
      }
    }
#endif
  }
  else
  {
    {
      if (webSocketClient.isConnected() && isConnected())
        webSocketClient.sendTXT(s.c_str());
      else
      {
        if (s.indexOf("EVENT:")<0) {
          webSocket.broadcastTXT(s.c_str());
#ifdef ESPNOWACTIVE
  sendMeshMessage(0,s.c_str(),1);
#endif
        }
        if (s.indexOf("EVENT:")>=0 ||  s.indexOf("s")==0)
        {
          s=s+",Web";
          senddata(s.c_str());
        }
      }
    }
  }
}

void sendToServer(String msg, int isServer)
{
  String s;
  s = ID + "=" + msg;
  if (amServer)
  {
  }
  else
  {
if (webSocketClient.isConnected() && isConnected())
    webSocketClient.sendTXT(s.c_str());
        else
    if (s.indexOf("EVENT:")<0)
     webSocket.broadcastTXT(s.c_str());
  }
}

