Sank7383/ESP8266_Newmesh/NewMeshNOW.h
void deviceData(const char*formdata)
{
  if (strncmp(formdata,"DEVICES:",8)==0)
    formdata = formdata+8;
  int formid = -1;
  char *command = strtok((char *)formdata, " ");
  int id10 = 0;
  char *devname;

  if (command != 0)
  {
    id10 = atoi(command);
    command = strtok(NULL, " ");
  }

  if (command != 0)
  {
    devname = command;
    command = strtok(NULL, " ");
  }
  char ext = 'T';
  if (command != 0)
  {
    ext = (*(char *)command);
    command = strtok(NULL, " ");
  }
  // Alexa device registration dropped for v1 — id10/devname/ext parsed above
  // are kept available for a future non-Alexa device-directory feature.
#ifndef MQTTNOTREQUIRED
  if (client.connected())
    Mysubscribe(id10);
#endif
  return;
}
byte parsem = 0, parser = 0;
char parseMessages[10][301];
bool parseisServer[10];
void decodeString2(const char *msm, int isServer)
{
  if (nowmillis-lastdecode<1000 && strncmp(lastdecodestring,msm,300)==0)
  {
    return;
  }
  lastdecode=nowmillis;
  strncpy(lastdecodestring,msm,300);

  if (parsem < 10)
  {
    if (parsem>0 && parsem>parser){
      if (strncmp(parseMessages[parsem-1],msm,300)==0) return;
    }

    strncpy(parseMessages[parsem],msm,300);
    parseisServer[parsem++] = isServer;
  }
}
void parse_out_loop()
{
  while (parsem > parser)
  {
    decodeString1(parseMessages[parser], parseisServer[parser]);
    parseMessages[parser][0] = 0;
    parseisServer[parser] = false;
    parser++;
  }
  if (parsem == parser and parsem > 0)
  {
    parsem = 0;
    parser = 0;
  }
}

#ifndef MQTTNOTREQUIRED
void Mysubscribe(int id, int unsub)
{
  char subscribe[50];
  strlcpy(subscribe, "light-in/", sizeof(subscribe));

  char myID[10];
  itoa(id, myID, 16);
  strlcat(subscribe, (char *)myID, sizeof(subscribe));
  strlcat(subscribe, "/", sizeof(subscribe));
  itoa(id, myID, 10);
  strlcat(subscribe, (char *)myID, sizeof(subscribe));
  if (unsub == 1)
    client.unsubscribe(subscribe);
  else
    client.subscribe(subscribe);
}

// removeAll()/connectAll() originally walked Espalexa's `extradevices` linked
// list (one MQTT subscribe per virtual Alexa-exposed device sharing this
// ESP8266) to un/resubscribe them on MQTT connect/disconnect. Espalexa was
// intentionally dropped from this rewrite (see plan) — no `espalexa` object
// or `extradevices` concept exists here — so these are now no-ops, kept
// only so reconnect()'s existing connectAll() call site still compiles.
// removeAll() itself has no callers left; kept for symmetry/documentation.
void removeAll()
{
}
void connectAll()
{
}
#endif

char subscribe[50];
char myID[10];

#ifndef MQTTNOTREQUIRED
char ds[100];
// See removeAll()/connectAll() above — same Espalexa `extradevices` walk,
// same reason it's now a no-op. Kept only so its MQTT-payload-handler call
// site (further down this file) still compiles.
void ForwardPublish(const char *msm)
{
  (void)msm;
}
#endif
int devicelist = 0;
void decodeString1(const char *msm, int isServer)
{
  debugdata(msm);
  lastdecode=nowmillis;
  if (!msm) return;
  if (strncmp(msm,"DEVICES:",8)==0)
  {
    deviceData(msm);
  }

  if (isServer == 1)
  {
    // A directly-connected local client (this device's own WebSocket
    // server, port 81) is unambiguously talking to exactly this one
    // device — no "<thisDeviceID>=" address prefix required. Commands
    // like "Test"/"GS"/"RESPONSE:..." fall straight through to the
    // dispatch block below as-is.
  }
  else if (isServer == 0 || isServer == 2)
  {
    // Relayed/mesh-origin traffic (this device acting as an uplink client,
    // or a message forwarded over ESP-NOW) DOES need the address prefix
    // stripped, since a shared medium can carry messages meant for other
    // devices too.
    debugdata(String("Received by Client from above ").c_str());
    debugdata(msm);
    if (strstr(msm,"EVENT:")) return;
    if (strstr(msm,"R1Gnull")) return;
    if (strncmp(msm,"NDEVICELIST",10)==0)
    {
      devicelist=0;
      String msg = "DEVICES:" + ID + " " + myConfig.myDeviceName + " " + String(myConfig.myDeviceIdentification);
      sendToAll(msg.c_str(), 2);
      decodeString(msm, 0);
      return;
    }

    char buf[1024];
    sprintf_P(buf, PSTR("%s="),ID.c_str());

    if (strncmp(msm,buf,strlen(buf))==0)
    {
      msm = msm+strlen(buf);
    }
    else
    {
#ifdef MASTERCONTROLLER
      if (strncmp(msm,"s",1)==0){
        decodeString(msm,0);
      }
#endif
#ifdef NURSECALLNEW
      if (strncmp(msm,"j",1)==0){
        decodeString(msm,0);
      }
      if (strncmp(msm,"os",2)==0 && *(msm+strlen(msm)-1)=='9'){
        decodeString(msm,0);
      }
      if (strstr(msm,"=s")){
        decodeString(msm,0);
      }
#endif
      return;
    }
  }

  if (!strncmp(msm,"SOCKETCLIENTCONNECTED",10))
  {
    devicelist=1;
  }
  else
  if (!strncmp(msm,"GS",2))
  {
    getCurrentStatus1(msgp, sizeof(msgp));
    sendMeshMessage(0,String(msgp),1);
  }
  else if (!strncmp(msm,"Reboot",7))
  {
    // Unauthenticated by construction: any locally-connected WebSocket
    // client (isServer==1, no address-prefix check at all) or any
    // mesh-addressed sender who knows this device's ID can trigger this
    // with nothing more than the literal string "Reboot"/"Reset" — Allow
    // Reboot (Form 11) is the only lock on it. Form 0's own Reboot/Factory
    // Reset menu selections are NOT gated here — those are the deliberate
    // settings-UI action, always available.
    if (myConfig.allowReboot) ESPrestart();
    else debugdata("Reboot command received but Allow Reboot is Off - ignored");
  }
  else if (!strncmp(msm,"Reset",6))
  {
    if (myConfig.allowReboot) ESPrestart();
    else debugdata("Reset command received but Allow Reboot is Off - ignored");
  }
  else if (!strncmp(msm,"Test",5))
  {
    sendFormData(0);
  }
  else if (!strncmp(msm,"RESPONSE:",9))
  {
    getFormData(msm, 2);
  }
  else if (!strncmp(msm,"UPDATE",7))
  {
    ESP.wdtFeed();
    handleBinUpdate(1);
  }
  else
    decodeString(msm, 0);
}
int wscdisconnect = 0;
void webSocketEventClient(WStype_t type, uint8_t *payload, size_t length)
{
  switch (type)
  {
  case WStype_DISCONNECTED:
    debugdata(String("Uplink WebSocket DISCONNECTED (reconnect count now " + String(wscdisconnect + 1) + ")").c_str());
    lst_wscon=0;
    if (isConnected())
      wscdisconnect++;
    if (wscdisconnect > 20 && !amServer)
    {
        wscdisconnect=0;
    }
    break;
  case WStype_CONNECTED:
  {
    debugdata("Uplink WebSocket CONNECTED");
    lst_wscon= millis();
    wscdisconnect = 0;
    disconnectcount = 0;
    if (webSocketClient.isConnected() && isConnected())
    webSocketClient.sendTXT("ESP");
    String msg = "DEVICES:" + ID + " " + String(myConfig.myDeviceName) + " " + String(myConfig.myDeviceIdentification);
    if (webSocketClient.isConnected() && isConnected())
    webSocketClient.sendTXT(msg);
    sendAllDevices();
  }
  break;
  case WStype_TEXT:
    {
    if (strstr((const char *)payload,"INFO:")) return;
    if (strstr((const char *)payload,"Info:")) return;
    if (strstr((const char *)payload,"o")==(const char *)payload) {
      if (strstr((const char *)payload,",9")==NULL){
        return;
      }
    }

