Sank7383/ESP8266_Newmesh/NewMeshNOW.h
    if (strstr((const char *)payload,"IGNORE:")) return;
    if (strstr((const char *)payload,"R1G")==(const char *)payload) return;
    debugdata(String("Received by webSocketClient").c_str());
    debugdata((const char *)payload);

    if (amServer)
    {
#ifdef NURSECALLNEW
    sendMeshMessage(0,(const char *)payload,1,2);
#endif
    }
    else
    {
    }
    if (amServer==0){
      decodeString2((const char *)payload, 0);
    }
    else{
      decodeString2((const char *)payload, 1);
    }
    }
    break;
  case WStype_BIN:
{
  if (length != sizeof(MeshPacket)) return;
  int nextHead = (rxHead + 1) % RX_QUEUE_SIZE;
  if (nextHead == rxTail) {
    return;
  }
  memcpy(&rxQueue[rxHead], payload, length);
  rxHead = nextHead;
  }
    break;
  case WStype_PING:
    break;
  case WStype_PONG:
    break;
  }
}

void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  switch (type)
  {
  case WStype_DISCONNECTED:
    if (connum==num) connum=-1;
    if(num<5)
    ESPN[num]=0;
    break;
  case WStype_CONNECTED:
  {
    if (connum==-1) connum=num;
    if(num<5)
    ESPN[num] = 1;
    IPAddress ip = webSocket.remoteIP(num);
    webSocket.sendTXT(num, String("Connected:" + ID + ":1").c_str());
  }
  break;
  case WStype_PING:
  case WStype_PONG:
  break;
  case WStype_TEXT:
  {
    if (connum==num) connum=-1;
    if (strstr((const char *)payload,"IGNORE:")) return;
    if(num<5)
    if ((char)payload[0] == 'E' && (char)payload[1] == 'S' && (char)payload[2] == 'P' && length == 3)
    {
      ESPN[num] = 2;
      devicelist=1;
      return;
    }

    if (amServer)
    {
#ifndef MQTTNOTREQUIRED
        if (amServer==1){
          if (client.connected())
          {
            {
              ForwardPublish((const char *)payload);
            }
          }
        }
#endif
#ifdef ESPNOWACTIVE
    sendMeshMessage(0,(const char *)payload,1,2);
#endif
    }
    else
    {
#ifdef ESPNOWACTIVE
      sendMeshMessage(0,(const char *)payload,1);
#endif
    }
    decodeString2((const char *)payload, 1);
  }
    break;
  case WStype_BIN:
  if (length != sizeof(MeshPacket)) return;
  int nextHead = (rxHead + 1) % RX_QUEUE_SIZE;
  if (nextHead == rxTail) {
    return;
  }
  memcpy(&rxQueue[rxHead], payload, length);
  rxHead = nextHead;
    break;
  }
}

// ==========================================
// AP identity — always-on, two live states
// ==========================================
// The device runs AP+STA concurrently at all times, regardless of which
// route (WiFi mesh / RS485 / Ethernet) is selected, so on-site staff can
// always reach the settings page — the AP never turns off. Its IDENTITY
// does still reflect live connection state, matching the pre-rewrite
// behavior: standalone (no upstream network joined) broadcasts
// "NETE<asccode><id>" on 192.168.6.x; once bridged to a real upstream
// WiFi network it switches to "MESH<asccode><id>" on 192.168.(100+id).x
// so other mesh nodes can find it. Both asccode/id are read live, so a
// settings change takes effect the next time this re-evaluates.
bool apInitialized = false;
bool lastApConnectedState = false;   // forces the first setup_AP() call through
void setup_AP(bool forceRestart)
{
  if(manulalAP==true) return ;

  bool connected = isConnected();

  if (apInitialized && !forceRestart) return;
  if (apInitialized && connected == lastApConnectedState) return;   // nothing actually changed
  apInitialized = true;
  lastApConnectedState = connected;

  uint8_t octet3 = connected ? (100 + (myConfig.machineid & 0xFF)) : 6;
  if (octet3 > 250 || octet3 == 0) octet3 = 6;

  apIP = IPAddress(192, 168, octet3, 1);
  IPAddress apGateway(apIP);
  IPAddress apSubmask(255, 255, 255, 0);
  WiFi.softAPdisconnect(true);
  WiFi.softAPConfig(apIP, apGateway, apSubmask);

  String apSsid = connected ? (MESHNETWORK + String(myConfig.asccode) + String(myConfig.machineid))
                             : ("NETE" + String(myConfig.asccode) + String(myConfig.machineid));
  const char *apPassword = connected ? "MESHPASSWORD" : "Netsol@123";
  WiFi.softAP(apSsid.c_str(), apPassword, myConfig.wifiChannel ? myConfig.wifiChannel : 1, 0, 4);
  dbgPrintln(1, "Initialized AP as IP '" + apIP.toString() + "' SSID " + apSsid);
}

// ==========================================
// Uplink (device -> central server) connect/reconnect
// ==========================================
// Single place that (re)establishes the uplink, whether that's a mesh-peer
// gateway (plain WebSocket to WiFi.gatewayIP():81) or the configured
// external server via myConfig.myServer/myPort — as WebSocket or Socket.IO
// depending on myConfig.socketio. Called once when STA first gets an IP,
// and again periodically by uplinkHealthCheck() below whenever the link is
// found to be down, matching the legacy firmware's reconnectServer().
void connectUplink()
{
  if (WiFi.SSID().startsWith(MESHNETWORK) || WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_"))
  {
    debugdata(String("Uplink: connecting to mesh gateway " + WiFi.gatewayIP().toString() + ":81").c_str());
    if (webSocketClient.isConnected()) webSocketClient.disconnect();
    webSocketClient.begin(WiFi.gatewayIP(), 81, "/");
    webSocketClient.onEvent(webSocketEventClient);
    webSocketClient.setReconnectInterval(2000);
    webSocketClient.enableHeartbeat(3000, 3000, 2);
    return;
  }

  if (strlen(myConfig.myServer) == 0)
  {
    debugdata("Uplink: myServer is empty - nothing to connect to");
    return;
  }

  if (myConfig.socketio)
  {
    webSocketIo.close();
    socketIoPath = "/socket.io/?asccode=" + String(myConfig.asccode) + "&d=0&type=1&EIO=3";
    debugdata(String("Uplink: connecting SocketIO to " + String(myConfig.myServer) + ":" + String(myConfig.myPort) + socketIoPath).c_str());
    webSocketIo.begin(myConfig.myServer, myConfig.myPort, socketIoPath, "");
    webSocketIo.onEvent(socketIOEvent);
  }
  else
  {
    debugdata(String("Uplink: connecting WebSocket to " + String(myConfig.myServer) + ":" + String(myConfig.myPort)).c_str());
    if (webSocketClient.isConnected()) webSocketClient.disconnect();
    webSocketClient.begin(myConfig.myServer, myConfig.myPort, "/", "");
    webSocketClient.onEvent(webSocketEventClient);
    webSocketClient.setReconnectInterval(2000);
    webSocketClient.enableHeartbeat(3000, 3000, 2);
  }
}

