Sank7383/ESP8266_Newmesh/NewMeshNOW.h
void socketIOEvent(socketIOmessageType_t type, uint8_t *payload, size_t length)
{
  switch (type)
  {
    case sIOtype_DISCONNECT:
      if (!socketconnectedio) { lst_con = millis(); return; }
      socketconnectedio = false;
      lst_con = millis();
      debugdata("Uplink SocketIO DISCONNECTED");
      break;
    case sIOtype_CONNECT:
      socketconnectedio = true;
      lst_con = millis();
      debugdata("Uplink SocketIO CONNECTED");
      webSocketIo.send(sIOtype_CONNECT, "/");   // join default namespace - required, no auto-join in Socket.IO v3+
      break;
    default:
      break;
  }
}

// Periodic (called from myrun()) — verifies the uplink is actually up,
// retries via connectUplink() every 3rd failed check, re-pushes current
// status once a reconnect succeeds, and restarts the device if the link
// has been down for a very long time — matching the legacy firmware's
// dcount/webSocketNotConnected/reconnectServer() health-check loop.
void uplinkHealthCheck()
{
  if (ethercon == 1) return;                 // Ethernet route doesn't use this WiFi uplink
  if (WiFi.status() != WL_CONNECTED) return;  // STA not even joined yet - nothing to check

  bool isMeshPeer = WiFi.SSID().startsWith(MESHNETWORK) || WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_");
  if (!isMeshPeer && strlen(myConfig.myServer) == 0) return;   // nothing configured to connect to

  bool up = (myConfig.socketio && !isMeshPeer) ? webSocketIo.isConnected() : webSocketClient.isConnected();

  if (up)
  {
    if (uplinkFailCount > 0)
    {
      debugdata("Uplink: reconnected - resending current status");
      resendCurrentStatus();
    }
    uplinkFailCount = 0;
    return;
  }

  uplinkFailCount++;
  debugdata(String("Uplink: DOWN (fail count " + String(uplinkFailCount) + ")").c_str());
  if (uplinkFailCount % 3 == 0)
  {
    connectUplink();
  }
  if (uplinkFailCount > 12 && millis() > 120000)
  {
    // Self-healing auto-restart, still gated by Allow Reboot (Form 11) —
    // without it, a facility that's deliberately disabled all reboot
    // vectors would otherwise still get bounced by this one. Without the
    // restart, connectUplink() above (every 3rd failed check) keeps trying
    // indefinitely instead.
    if (myConfig.allowReboot) {
      debugdata("Uplink: down too long - restarting device");
      delay(100);
      ESP.restart();
    } else {
      debugdata("Uplink: down too long but Allow Reboot is Off - not restarting, will keep retrying");
    }
  }
}

WiFiEventHandler gotIpEventHandler, disconnectedEventHandler, SoftAPModeStationDisconnected, SoftAPModeStationConnected;

byte ssidconnected=0;
void connectWiFiEvents()
{
  SoftAPModeStationConnected = WiFi.onSoftAPModeStationConnected([](const WiFiEventSoftAPModeStationConnected &event)
                                                                 {
                                                                 });

  SoftAPModeStationDisconnected = WiFi.onSoftAPModeStationDisconnected([](const WiFiEventSoftAPModeStationDisconnected &event)
                                                                       {
                                                                       });

  gotIpEventHandler = WiFi.onStationModeGotIP([](const WiFiEventStationModeGotIP &event)
                                              {
                                                IPAddress ipipad;
                                                ipipad = WiFi.localIP();
                                                debugdata(String("STA got IP " + ipipad.toString() + " on SSID '" + WiFi.SSID() + "'").c_str());
                                                if (ipipad[0] <= 0)
                                                {
                                                  debugdata("STA IP invalid (0.x.x.x) - disconnecting and retrying");
                                                  WiFi.disconnect();
                                                  return;
                                                }
                                                if (WiFi.SSID() == myConfig.mySSID)
                                                {
                                                  ssidconnected=0;
                                                  String ipad = myConfig.myIP;
                                                  String netm = myConfig.myNetmask;
                                                  String gatw = myConfig.myGateway;
                                                  IPAddress ipipad, ipnetm, ipgatw,ipdns;
                                                  ipdns.fromString("8.8.8.8");
                                                  if (ipipad.fromString(ipad.c_str()) == 1 && ipnetm.fromString(netm.c_str()) == 1 && ipgatw.fromString(gatw.c_str()) == 1)
                                                  {
                                                    if (ipipad[0] > 0)
                                                      WiFi.config(ipipad, ipgatw, ipnetm, ipgatw,ipdns);
                                                  }
                                                }
                                                amServer = AmServer();
                                                setup_AP(true);   // re-evaluate AP subnet now that STA is bridged (SSID unchanged)
                                                if (WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_") )
                                                  netsoltime = nowmillis;
                                                else
                                                  netsoltime = 0;
#ifndef MQTTNOTREQUIRED
                                                if (amServer==1 && !(WiFi.SSID().startsWith(MESHNETWORK) || WiFi.SSID().startsWith("NETSOL") || WiFi.SSID().startsWith("NOW_"))){
                                                  client.setServer("www.ask4token.com", 1883);
                                                  client.setCallback(callback);
                                                }
#endif
                                                uplinkFailCount = 0;
                                                connectUplink();
                                              });

  disconnectedEventHandler = WiFi.onStationModeDisconnected([](const WiFiEventStationModeDisconnected &event)
                                                            {
                                                              disconnectcount++;
                                                              ssidconnected++;
                                                              if (ssidconnected<5)
                                                              {
                                                                WiFi.reconnect();
                                                                myruntime = nowmillis+10000;
                                                                return;
                                                              }
                                                              ssidconnected = 0;
                                                              if (disconnectcount > 30)
                                                              {
                                                                disconnectcount = 0;
                                                              }
                                                              WiFi.disconnect(true);
                                                              amServer = AmServer();
                                                              webSocketClient.setReconnectInterval(300000);
                                                              if (webSocketClient.isConnected()) webSocketClient.disconnect();
                                                              // AP stays up regardless of STA connection state — only its
                                                              // subnet falls back to standalone (192.168.6.x); SSID unchanged.
                                                              setup_AP(true);
                                                              myruntime = nowmillis+10000;
                                                            });
}

char messg[1000];
void callback(char *topic, byte *payload, unsigned int length)
{
  char *data = (char *)topic;
  if (strstr(data, "/"))
    data = strstr(data, "/") + 1;
  if (strstr(data, "/"))
    data = strstr(data, "/") + 1;
  strlcpy(messg, data, sizeof(messg));
  strlcat(messg, "=", sizeof(messg));
  size_t messglen = strlen(messg);
  memcpy(messg + messglen, payload, length);
  messg[messglen + length] = 0;

  sendToAll(messg,2);
  decodeString2(messg, 2);
}
#ifndef MQTTNOTREQUIRED
boolean mqttconnected = 0;
uint8_t mqttserver = 0;
int value = 0;
boolean reconnect()
{
  String clientId = "EClient-";
  clientId += ID;
  const char *username = "mqtt_user_name";
  const char *password = "mqtt_password";
  mqttserver++;
  if (mqttserver > 3)
    mqttserver = 0;
  client.setServer(mqtt_server[mqttserver], 1883);
  client.setCallback(callback);
  client.setBufferSize(1024);
  if (!isConnected()) return false;

  if (client.connect(clientId.c_str(), username, password))
  {
    mqttconnected = 1;
    Mysubscribe(atoi(ID.c_str()));
    connectAll();
    return true;
  }
  return client.connected();
}

