Sank7383/ESP8266_Newmesh/NewMeshNOW.h
long lastReconnectAttempt = 0;
void mqttloop()
{
  if (amServer && isConnected())
  {
    if (!client.connected())
    {
      mqttconnected = 0;
      long now = nowmillis;
      if (now - lastReconnectAttempt > wclienttimedelay)
      {
        lastReconnectAttempt = now;
        espClient.setTimeout(1000);
        if (reconnect())
        {
          wclienttimedelay=1000;
          lastReconnectAttempt = 0;
        }
        if (wclienttimedelay<180000)
          wclienttimedelay=wclienttimedelay+5000;
      }
    }
    else
    {
      client.loop();
      unsigned long now = nowmillis;
      if (now - lastMsg > 2000)
      {
        lastMsg = now;
        ++value;
      }
    }
  }
}
#endif
unsigned long last_10sec = 0, dcount = 0;
unsigned int counter = 0;
uint8_t firsttime = 0;
unsigned long wifimultirun = 0;

void tdinputn(const char *spanstring,
              const char *nameString,
              const char *required,
              const char *nameid,
              int maxlength,
              const char *valuestring,
              int colspan,
              char *outBuf,
              size_t outLen)
{
    snprintf(outBuf, outLen,
        "<td colspan=\"%d\">"
        "<label for=\"%s\">"
        "<span %s>%s"
        "<span class=\"required\">%s</span></span>"
        "<input type=\"text\" class=\"input-field\" id=\"%s\" "
        "name=\"%s\" value=\"%s\" maxlength=\"%d\" />"
        "</label></td>",
        colspan, nameid, spanstring, nameString,
        required, nameid, nameid, valuestring, maxlength);
}

// ==========================================
// /forms — minimal browser client for the WebSocket settings-form protocol
// ==========================================
// This is the ONLY UI for viewing/changing settings now that the old
// HTML-form-generator page is gone. It speaks the exact same
// $NEXT$/$DONE$/$T|/$D|/$R| + "RESPONSE:formid|argk|value ..." protocol
// DeviceProtocol.cpp's sendFormData()/getFormData() already implement — no
// separate companion app is required, any browser works.
const char FORMS_PAGE[] PROGMEM = R"rawliteral(
<!DOCTYPE html><html><head><meta name="viewport" content="width=device-width,initial-scale=1">
<title>Nurse Call Settings</title>
<style>
body{font-family:sans-serif;margin:0;padding:16px;background:#f4f4f4;color:#222}
h2{margin-top:0}
.field{margin-bottom:12px}
label{display:block;font-weight:bold;margin-bottom:4px;font-size:14px}
input,select,textarea{width:100%;padding:8px;box-sizing:border-box;font-size:16px}
button{padding:10px 16px;font-size:15px;margin:4px 6px 4px 0;cursor:pointer}
#menu button{display:block;width:100%;text-align:left;margin-bottom:6px}
#status{color:#666;font-size:13px;margin-bottom:14px}
#logpanel{margin-top:18px}
#logpanel h3{margin-bottom:6px}
#log{background:#111;color:#0f0;font-family:monospace;font-size:12px;height:220px;overflow-y:auto;
     padding:8px;box-sizing:border-box;white-space:pre-wrap;border-radius:4px}
#logpanel button{font-size:13px;padding:4px 10px}
</style></head>
<body>
<h2>Nurse Call Settings</h2>
<div id="status">Connecting...</div>
<div id="app"></div>
<div id="logpanel">
  <h3>Live Debug Log <button onclick="clearLog()">Clear</button></h3>
  <div id="log"></div>
</div>
<script>
var ws, formId = -1;
function setStatus(s) { document.getElementById("status").textContent = s; }
function send(s) { if (ws && ws.readyState === 1) ws.send(s); }
function connect() {
  ws = new WebSocket("ws://" + location.hostname + ":81/");
  ws.onopen = function () { setStatus("Connected, loading menu..."); };
  ws.onclose = function () { setStatus("Disconnected - retrying..."); setTimeout(connect, 2000); };
  ws.onerror = function () { setStatus("Connection error"); };
  ws.onmessage = function (e) { handleMessage(e.data); };
}
var logLines = [];
function clearLog() { logLines = []; document.getElementById("log").textContent = ""; }
function appendLog(text) {
  var t = new Date().toLocaleTimeString();
  logLines.push("[" + t + "] " + text);
  if (logLines.length > 300) logLines.shift();
  var el = document.getElementById("log");
  el.textContent = logLines.join("\n");
  el.scrollTop = el.scrollHeight;
}
function handleMessage(raw) {
  var msg = raw;
  if (msg.indexOf("DBG:") === 0) { appendLog(msg.substring(4)); return; }
  var eq = msg.indexOf("=");
  if (eq > 0 && eq < 20 && msg.indexOf("FORM:") !== 0 && msg.indexOf("Connected") !== 0) {
    msg = msg.substring(eq + 1);
  }
  if (msg.indexOf("Connected:") === 0) { send("Test"); return; }
  if (msg.indexOf("FORM:") === 0) { renderForm(msg); return; }
}
function renderForm(msg) {
  var body = msg.substring(5);
  var idEnd = body.indexOf("$");
  formId = parseInt(body.substring(0, idEnd), 10);
  var tokens = body.substring(idEnd).split("$").filter(function (t) { return t.length > 0; });
  var title = "Settings", fields = [], isMenu = false, menuOptions = [];
  tokens.forEach(function (tok) {
    if (tok.indexOf("NEXT$") === 0 || tok.indexOf("DONE$") === 0) {
      title = tok.substring(5);
    } else if (tok.indexOf("T|") === 0) {
      var p = tok.substring(2).split("|");
      fields.push({ type: "T", label: p[0], value: decodeURIComponent(p[2] || "") });
    } else if (tok.indexOf("D|") === 0) {
      var p = tok.substring(2).split("|");
      var opts = p[1].split("#").map(function (o) { var kv = o.split(":"); return { label: kv[0], value: kv[1] }; });
      fields.push({ type: "D", label: p[0], options: opts, value: p[2] });
    } else if (tok.indexOf("R|") === 0) {
      var p = tok.substring(2).split("|");
      isMenu = true;
      menuOptions = p[1].split("#").map(function (o) { var kv = o.split(":"); return { label: kv[0], value: kv[1] }; });
    }
  });
  var app = document.getElementById("app");
  app.innerHTML = "";
  var h = document.createElement("h3"); h.textContent = title; app.appendChild(h);
  setStatus("Form " + formId + " loaded");
  if (isMenu) {
    var div = document.createElement("div"); div.id = "menu";
    menuOptions.forEach(function (o) {
      var b = document.createElement("button");
      b.textContent = o.label;
      b.onclick = function () { send("RESPONSE:0|0 0|" + o.value); };
      div.appendChild(b);
    });
    app.appendChild(div);
    return;
  }
  var form = document.createElement("div");
  fields.forEach(function (f, i) {
    var wrap = document.createElement("div"); wrap.className = "field";
    var lab = document.createElement("label"); lab.textContent = f.label; wrap.appendChild(lab);
    var input;
    if (f.type === "D") {
      input = document.createElement("select");
      f.options.forEach(function (o) {
        var opt = document.createElement("option");
        opt.value = o.value; opt.textContent = o.label;
        if (o.value === f.value) opt.selected = true;
        input.appendChild(opt);
      });
    } else if (f.label === "Debug") {
      input = document.createElement("textarea");
      input.readOnly = true;
      input.rows = 10;
      input.style.width = "100%";
      input.style.boxSizing = "border-box";
      input.style.fontFamily = "monospace";
      input.style.fontSize = "13px";
      input.style.whiteSpace = "pre-wrap";
      input.value = f.value;
    } else {
      input = document.createElement("input");
      input.type = "text";
      input.value = f.value;
    }
    input.dataset.idx = i;
    wrap.appendChild(input);
    form.appendChild(wrap);
  });
  app.appendChild(form);
  var saveBtn = document.createElement("button");
  saveBtn.textContent = "Save";
  saveBtn.onclick = function () {
    var inputs = form.querySelectorAll("input,select");
    var parts = ["RESPONSE:" + formId + "|" + formId];
    inputs.forEach(function (inp) { parts.push(inp.dataset.idx + "|" + encodeURIComponent(inp.value)); });
    send(parts.join(" "));
    setStatus("Saved, reloading...");
  };
  app.appendChild(saveBtn);
  var backBtn = document.createElement("button");
  backBtn.textContent = "Back to Menu";
  backBtn.onclick = function () { send("Test"); };
  app.appendChild(backBtn);
}
connect();
</script>
</body></html>
)rawliteral";

