Sank7383/ESP8266_Newmesh/NewMeshNOW.h
uint32_t ith=0;
uint32_t getInternalBootCode()
{
    uint32_t result;
    ESP.rtcUserMemoryRead (0, (uint32_t*) &result, sizeof(result));
    ith=result;
    return result;
}

void setInternalBootCode(uint32_t value)
{
    uint32_t storeValue = value;
    ESP.rtcUserMemoryWrite(0, (uint32_t*) &storeValue, sizeof(storeValue));
    getInternalBootCode();
}

void startconnection()
{
  // Config is already loaded (with structVersion-guarded defaults applied)
  // by configLoad() in NurseCallConfig.cpp, called once from setup() before
  // this — do not reload/overwrite myConfig here.
  getInternalBootCode();
  if (myConfig.machineid<0) myConfig.machineid=0;
  WiFi.persistent(false);

  WiFi.mode(WIFI_AP_STA);
  WiFi.setAutoReconnect(false);
  WiFi.disconnect(true);
  WiFi.setOutputPower(20.5);
  setup_AP();
  connectWiFiEvents();

  addAP("test_ms", "netsol@123MS");

  // Gated on myConfig.networkType (known at boot from configLoad()), NOT
  // `ethercon` — ethercon is only ever set by TransportEthernet::begin(),
  // which runs AFTER this (see ESP8266_Newmesh.ino's setup(): startconnection()
  // via LocalAccessStack::begin() happens before g_statusUplink->begin()).
  // Checking ethercon==0 here was always true at this point regardless of
  // route, so an Ethernet-configured unit would still scan/attempt to join
  // mySSID (and the mesh-peer APs below) for no reason — this is what made
  // leaving mySSID/myPass with old or placeholder ("0000") values on an
  // Ethernet unit actually attempt a pointless WiFi join. Selecting
  // Ethernet as Network Type (Form 1) now skips all of that outright,
  // regardless of what's in mySSID/myPass.
  bool wifiNetworkSelected = (myConfig.networkType != (uint8_t)NetworkType::ETHERNET);

  if (wifiNetworkSelected && String(myConfig.mySSID).length() > 3 && String(myConfig.myPass).length() > 3)
    addAP(myConfig.mySSID, myConfig.myPass);

  if (wifiNetworkSelected) {
    if (myConfig.machineid>0)
      addAP(String(MESHNETWORK+String(myConfig.asccode)+String(myConfig.machineid-1)).c_str(), "MESHPASSWORD");
    if (myConfig.machineid>1)
      addAP(String(MESHNETWORK+String(myConfig.asccode)+String(myConfig.machineid-2)).c_str(), "MESHPASSWORD");
  }

  addAP("homeauto", "HA@123home");
  addAP("test_ms10", "netsol@123MS");

  myrun();

  webSocket.begin();
  webSocket.enableHeartbeat(3000, 3000, 2);
  webSocket.onEvent(webSocketEvent);

  server.on("/forms", []()
            {
              server.send_P(200, "text/html", FORMS_PAGE);
            });
  server.on("/reboot", []()
            {
              // Plain unauthenticated GET — anyone who can reach this
              // device's webserver (same port as /forms) could otherwise
              // reboot it at will. Allow Reboot (Form 11) is the only lock;
              // Form 0's own Reboot/Factory Reset menu is unaffected.
              if (myConfig.allowReboot) {
                server.send(200, "text/html", "OK");
                ESPrestart();
              } else {
                server.send(200, "text/html", "Allow Reboot is Off - ignored");
              }
            });
  server.on("/send", []()
            {
              sendToAll(server.arg("c").c_str(),2);
              decodeString2(server.arg("c").c_str(),1);
              server.send(200, "text/html", "OK");
            });

  server.on("/settingn", []()
            {
            copyString(myConfig.mySSID,server.arg("ssid"),sizeof(myConfig.mySSID));
            copyString(myConfig.myPass,server.arg("pass"),sizeof(myConfig.myPass));
            copyString(myConfig.myDeviceName,server.arg("ascs"),sizeof(myConfig.myDeviceName));
            myConfig.machineid=atoi(server.arg("ports").c_str());
            copyString(myConfig.myIP,server.arg("ips"), sizeof(myConfig.myIP));
            copyString(myConfig.myGateway,server.arg("gates"), sizeof(myConfig.myGateway));
            copyString(myConfig.myNetmask,server.arg("netmasks"), sizeof(myConfig.myNetmask));

   EEPROM.put(100, myConfig);
    EEPROM.commit();
    ESP.wdtFeed();

    String content = "{\"Success\":\"saved to eeprom... reset to boot into new wifi\"}<script>document.location='/reboot';</script>";
  server.send(200, "text/html", content);
            });
  server.on("/id", []() {
    String s = "MySetID:"+String(ID)+"\n";
    server.send(200, "text/plain", s);
  });

  server.on("/", []()
            {
              getCurrentStatus1(msgp, sizeof(msgp));
              String msgs=String(msgp);
              msgs.replace(",", "<br>");
              server.send(200, "text/html", msgs + F("<br><a href='/forms'>Settings</a><br><a href='/reboot'>Reboot</a>"));
            });

  server.on("/refreshlist", HTTP_GET, []()
            {
              devicelist=1;
              server.send(200, "text/plain", "Refresh Ok");
            });

  server.begin();
  if (myConfig.myDeviceIdentification > 127)
    myConfig.myDeviceIdentification = 'T';
}

long lastgettime = 0;

// Device-directory (Alexa extradevices list) dropped for v1 along with
// Espalexa — both are now no-ops kept only so existing call sites compile
// unchanged; DeviceProtocol.cpp owns device status going forward.
void sendAllDevices()
{
}
void removeExtra()
{
}

void myrun()
{
  unsigned long t = millis();
  nowmillis=millis();
  wl_status_t status;
  parse_out_loop();
  webSocket.loop();

  if (isConnected()) {
    webSocketClient.loop();
    webSocketIo.loop();
  }

#ifndef MQTTNOTREQUIRED
  if (amServer==1)
    mqttloop();
#endif

  server.handleClient();
  status = WiFi.status();
  if (ethercon==1) status=WL_CONNECTED;
  if ((firsttime < 120) && (t>30000) && (status!=WL_CONNECTED))
  {
      firsttime++;
      if (firsttime == 120)
      {
        if (myConfig.type[0]==1){
          if (myConfig.machineid>0)
            addAP(String(MESHNETWORK+String(myConfig.asccode)+String(myConfig.machineid-1)).c_str(), "MESHPASSWORD");
          if (myConfig.machineid>1)
           addAP(String(MESHNETWORK+String(myConfig.asccode)+String(myConfig.machineid-2)).c_str(), "MESHPASSWORD");
        }
      }
  }

  if ((t - last_10sec) > 5000)
  {
    if (devicelist==1)
    {
      devicelist = 0;
    }
    if (ESP.getFreeHeap()<5100)
    {
      setup_AP(true);
    }

    uplinkHealthCheck();

    counter++;
    last_10sec = t;
  }
  if (t < myruntime)
    return;
  if (t - myruntime < 1000)
    return;

  myruntime = t;
  removeExtra();

